In [1]:
import psycopg2 as pg2
conn = pg2.connect(database='Budget', user='postgres', password="Dh41144185")

In [2]:
cur = conn.cursor()

In [3]:
cur.execute("CREATE TABLE IF NOT EXISTS test_table \
            (transaction_id SERIAL UNIQUE PRIMARY KEY,\
            date DATE NOT NULL,\
            account VARCHAR(50) NOT NULL,\
            transaction_name TEXT,\
            amount NUMERIC(13,2) NOT NULL,\
            category VARCHAR(50));")
conn.commit()

In [4]:
conn.rollback()

In [5]:
cur.execute("SELECT * FROM test_table")
results = cur.fetchall()
results

[(1,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (2,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (3,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (4,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food'),
 (5,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (6,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (7,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (8,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food')]

In [6]:
# cur.execute("""INSERT INTO test_table (date, account, transaction_name, amount, category)
#             VALUES
#             ('01-15-2013', 'CHASE_CHECKING', 'McDonalds', 10.13, 'Food'),
#             ('01-20-2013', 'CAPITAL_ONE', 'Walmart', 58.56, 'Grocery'),
#             ('01-23-2013', 'CHASE_CHECKING', 'IKEA', 350.65, 'Free_Expense'),
#             ('01-29-2013', 'CHASE_CHECKING', 'Wendys', 6.53, 'Food');""")
# conn.commit()

In [7]:
cur.execute("SELECT * FROM test_table")
results = cur.fetchall()
conn.rollback()
results

[(1,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (2,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (3,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (4,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food'),
 (5,
  datetime.date(2013, 1, 15),
  'CHASE_CHECKING',
  'McDonalds',
  Decimal('10.13'),
  'Food'),
 (6,
  datetime.date(2013, 1, 20),
  'CAPITAL_ONE',
  'Walmart',
  Decimal('58.56'),
  'Grocery'),
 (7,
  datetime.date(2013, 1, 23),
  'CHASE_CHECKING',
  'IKEA',
  Decimal('350.65'),
  'Free_Expense'),
 (8,
  datetime.date(2013, 1, 29),
  'CHASE_CHECKING',
  'Wendys',
  Decimal('6.53'),
  'Food')]

In [8]:
import pandas as pd
df = pd.DataFrame(results)

In [9]:
df

   0           1               2          3       4             5
0  1  2013-01-15  CHASE_CHECKING  McDonalds   10.13          Food
1  2  2013-01-20     CAPITAL_ONE    Walmart   58.56       Grocery
2  3  2013-01-23  CHASE_CHECKING       IKEA  350.65  Free_Expense
3  4  2013-01-29  CHASE_CHECKING     Wendys    6.53          Food
4  5  2013-01-15  CHASE_CHECKING  McDonalds   10.13          Food
5  6  2013-01-20     CAPITAL_ONE    Walmart   58.56       Grocery
6  7  2013-01-23  CHASE_CHECKING       IKEA  350.65  Free_Expense
7  8  2013-01-29  CHASE_CHECKING     Wendys    6.53          Food

```sql
SELECT transaction_test.transaction_date, account_test.account, transaction_test.transaction_name, 
transaction_test.amount, category_test.category, sub_category_test.subcategory,
category_type_test.category_type
FROM transaction_test
INNER JOIN transaction_data_test
ON transaction_test.transaction_id = transaction_data_test.transaction_id
INNER JOIN account_test
ON account_test.account_id = transaction_data_test.account_id
INNER JOIN category_test
ON category_test.category_id = transaction_data_test.category_id
INNER JOIN sub_category_test
ON sub_category_test.sub_category_id = transaction_data_test.sub_category_id
INNER JOIN category_type_test
ON category_type_test.category_type_id = transaction_data_test.category_type_id
ORDER BY transaction_test.transaction_date;

### Let's try to create a scenario of tables for this project

In [10]:
from datetime import datetime

category = [
    [1, "Food"],
    [2, "Transportation"],
    [3, "Grocery"],
    [4, "Investments"],
    [5, "Bills"],
    [6, "Free Expense"],
    [7, "Earnings"],
    [8, "Support"],
    [9, "Transfer"]
]
sub_category = [
    [1, "Phone Bill"],
    [2, "Car Insurance"],
    [3, "Restaurant"],
    [4, "Restaurant Tip"],
    [5, "Video Game"],
    [6, "Fast Food"],
    [7, "Grocery Store"],
    [8, "Walmart"],
    [9, "Donation"],
    [10, "Gas"],
    [11, "Credit Card payment"],
    [12, "Student Loan 1"],
    [13, "Student Loan 2"],
    [14, "Back-a-Boiler"],
    [15, "Salary"],
    [16, "Comission"],
    [17, "Charity"],
    [18, "Car Maintenance"],
    [19, "Business Expense"],
    [20, "Taxes"],
    [21, "Car Expense"],
    [22, "Rent"],
    [23, "Crypto Investment"],
    [24, "Stock Investment"],
    [25, "Hygiene"],
    [26, "Savings Transfer"],
    [27, "Entertainment"],
    [28, "Gift"],
    [29, "Book"],
    [30, "Subscription Renewal"],
    [31, "Snack"],
    [32, "Clothes"],
    [33, "Electronics"],
    [34, "Course"],
    [35, "Misc. Free Expense"],
    [36, "Costco"],
    [37, "Sam's Club"]
]

account = [
    [1, "Chase Checking"],
    [2, "Chase Savings"],
    [3, "Chase Freedom Unlimited"],
    [4,  "Capital One Savor One"],
    [5, "Stocks and Bonds (65:35)"],
    [6, "IRA"],
    [7, "Ledger"],
    [8, "Binance US"],
    [9, "Other Crypt Wallet"],
    [10, "Blackrock Money Market"],
    [11, "TD Ameritrade"]
]

category_type = [
    [1, "Income"],
    [2, "Expense"],
    [3, "Investment"],
    [4, "Payback"],
    [5, "Transfer"]
]

month = [
    [1, "January"],
    [2, "February"],
    [3, "March"],
    [4,  "April"],
    [5, "May"],
    [6, "June"],
    [7, "July"],
    [8, "August"],
    [9, "September"],
    [10, "October"],
    [11, "November"],
    [12, "December"]
]

transaction = [
    [1, datetime(2023, 1, 5), "Wendy's", 6.98],
    [2, datetime(2023, 1, 8), "Gas", 33.77],
    [3, datetime(2023, 1, 11), "Dara", 25.00],
    [4, datetime(2023, 1, 15), "Phone Bill", 40.00],
    [5, datetime(2023, 1, 16), "Park-To-Shop", 17.08],
    [6, datetime(2023, 1, 23), "Spice House", 50.72]
]

transaction_data = [
    [1, 1, 6, 4, 2, 1],
    [2, 2, 10, 1, 2, 1],
    [3, 8, 9, 1, 2, 1],
    [4, 5, 1, 1, 2, 1],
    [5, 3, 7, 4, 2, 1],
    [6, 6, 7, 1, 2, 1]
]
category_df = pd.DataFrame(category, columns=['category_id', 'category']) 
category_df = category_df.set_index(['category_id'])
sub_category_df = pd.DataFrame(sub_category, columns=['sub_category_id', 'sub_category'])
sub_category_df = sub_category_df.set_index(['sub_category_id'])
account_df = pd.DataFrame(account, columns=['account_id', 'account'])
account_df = account_df.set_index(['account_id'])
category_type_df = pd.DataFrame(category_type, columns=['category_type_id', 'category_type'])
category_type_df = category_type_df.set_index(['category_type_id'])
month_df = pd.DataFrame(month, columns=['month_id', 'month'])
month_df = month_df.set_index(['month_id'])
transaction_df = pd.DataFrame(transaction, columns=['transaction_id', 'transaction_date', 'transaction_name', "amount"]) 
transaction_df = transaction_df.set_index(['transaction_id'])
transaction_data_df = pd.DataFrame(transaction_data, columns=['transaction_id', 'category_id', 'sub_category_id', 'account_id', 'category_type_id', 'month_id']) 

category_df, sub_category_df, account_df, category_type_df, month_df, transaction_df, transaction_data_df

(                   category
 category_id
 1                      Food
 2            Transportation
 3                   Grocery
 4               Investments
 5                     Bills
 6              Free Expense
 7                  Earnings
 8                   Support
 9                  Transfer,
                          sub_category
 sub_category_id
 1                          Phone Bill
 2                       Car Insurance
 3                          Restaurant
 4                      Restaurant Tip
 5                          Video Game
 6                           Fast Food
 7                       Grocery Store
 8                             Walmart
 9                            Donation
 10                                Gas
 11                Credit Card payment
 12                     Student Loan 1
 13                     Student Loan 2
 14                      Back-a-Boiler
 15                             Salary
 16                          Comission
 17                            Charity
 18                    Car Maintenance
 19                   Business Expense
 20                              Taxes
 21                        Car Expense
 22                               Rent
 23                  Crypto Investment
 24                   Stock Investment
 25                            Hygiene
 26                   Savings Transfer
 27                      Entertainment
 28                               Gift
 29                               Book
 30               Subscription Renewal
 31                              Snack
 32                            Clothes
 33                        Electronics
 34                             Course
 35                 Misc. Free Expense
 36                             Costco
 37                         Sam's Club,
                              account
 account_id
 1                     Chase Checking
 2                      Chase Savings
 3            Chase Freedom Unlimited
 4              Capital One Savor One
 5           Stocks and Bonds (65:35)
 6                                IRA
 7                             Ledger
 8                         Binance US
 9                 Other Crypt Wallet
 10            Blackrock Money Market
 11                     TD Ameritrade,
                  category_type
 category_type_id
 1                       Income
 2                      Expense
 3                   Investment
 4                      Payback
 5                     Transfer,
               month
 month_id
 1           January
 2          February
 3             March
 4             April
 5               May
 6              June
 7              July
 8            August
 9         September
 10          October
 11         November
 12         December,
                transaction_date transaction_name  amount
 transaction_id
 1                    2023-01-05          Wendy's    6.98
 2                    2023-01-08              Gas   33.77
 3                    2023-01-11             Dara   25.00
 4                    2023-01-15       Phone Bill   40.00
 5                    2023-01-16     Park-To-Shop   17.08
 6                    2023-01-23      Spice House   50.72,
    transaction_id  category_id  sub_category_id  account_id  category_type_id  \
 0               1            1                6           4                 2
 1               2            2               10           1                 2
 2               3            8                9           1                 2
 3               4            5                1           1                 2
 4               5            3                7           4                 2
 5               6            6                7           1                 2

    month_id
 0         1
 1         1
 2         1
 3         1
 4         1
 5         1  )

In [11]:
transaction_df

               transaction_date transaction_name  amount
transaction_id
1                    2023-01-05          Wendy's    6.98
2                    2023-01-08              Gas   33.77
3                    2023-01-11             Dara   25.00
4                    2023-01-15       Phone Bill   40.00
5                    2023-01-16     Park-To-Shop   17.08
6                    2023-01-23      Spice House   50.72

In [12]:
from datetime import datetime

In [13]:
month_budget_id = str((int(1) * 10000) + int(2023))

month_budget_id

'12023'

In [17]:
# Get first day of the month
date = datetime(year=int(month_budget_id[1:]), month=int(month_budget_id[0:1]), day=1)

date

datetime.datetime(2023, 1, 1, 0, 0)

In [20]:
first_date = f"{date.year}-{date.month}-{date.day}"
first_date2 = f"{date.strftime('%Y-%m-%d')}"

first_date, first_date2

('2023-1-1', '2023-01-01')

In [21]:
import calendar

In [22]:
res = calendar.monthrange(date.year, date.month)
day = res[1]

res, day

((6, 31), 31)

In [25]:
month_dict ={
    'January'  : 1,
    'February' : 2,
    'March'    : 3,
    'April'    : 4,
    'May'      : 5,
    'June'     : 6,
    'July'     : 7,
    'August'   : 8,
    'September': 9,
    'October'  : 10,
    'November' : 11,
    'December' : 12,
}
month_list = month_dict.values()

for month_int in month_list:
    print(month_int)
month_dict, month_list

1
2
3
4
5
6
7
8
9
10
11
12

({'January': 1,
  'February': 2,
  'March': 3,
  'April': 4,
  'May': 5,
  'June': 6,
  'July': 7,
  'August': 8,
  'September': 9,
  'October': 10,
  'November': 11,
  'December': 12},
 dict_values([1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]))

In [50]:
def year_check(year=datetime.now().year):
    print(year.__class__)
    
year_check(2012)

<class 'int'>

In [55]:
empty_list = [(None,)]

full_list = [1, 2, 3, 4, 5, 6, 7, 8, 9]

print(empty_list[0][0])
if not empty_list[0][0]:
    print(full_list)

None
[1, 2, 3, 4, 5, 6, 7, 8, 9]

IndexError: list index out of range